build/classes/META-INF/wsdl/192.168.1.13_2/Service1.svc.singlewsdl.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Service1" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://tempuri.org/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/ProyectoWebService"/><xs:element name="GetData"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="value" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContract"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="composite" nillable="true" type="q1:CompositeType" xmlns:q1="http://schemas.datacontract.org/2004/07/ProyectoWebService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContractResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataUsingDataContractResult" nillable="true" type="q2:CompositeType" xmlns:q2="http://schemas.datacontract.org/2004/07/ProyectoWebService"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarFactura"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="idFactura" type="xs:int"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarFacturaResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="generarFacturaResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBaja"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="listaIdFactura" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="listaMotivoBaj" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="idEmpresa" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBajaResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="darDeBajaResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBajaNotaCredito"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="listaIdFactura" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="listaMotivoBaj" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="idEmpresa" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBajaNotaCreditoResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="darDeBajaNotaCreditoResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBajaNotaDebito"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="listaIdFactura" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="listaMotivoBaj" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="idEmpresa" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="darDeBajaNotaDebitoResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="darDeBajaNotaDebitoResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="convertiToLetter"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="numero" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="convertiToLetterResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="convertiToLetterResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarNotaCredito"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="idNotaCredito" type="xs:int"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarNotaCreditoResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="generarNotaCreditoResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarNotaDebito"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="idNotaDebito" type="xs:int"/><xs:element minOccurs="0" name="empresa" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="generarNotaDebitoResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="generarNotaDebitoResult" type="xs:boolean"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/ProyectoWebService" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/ProyectoWebService"><xs:complexType name="CompositeType"><xs:sequence><xs:element minOccurs="0" name="BoolValue" type="xs:boolean"/><xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CompositeType" nillable="true" type="tns:CompositeType"/></xs:schema></wsdl:types><wsdl:message name="IService1_GetData_InputMessage"><wsdl:part name="parameters" element="tns:GetData"/></wsdl:message><wsdl:message name="IService1_GetData_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataResponse"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_InputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContract"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContractResponse"/></wsdl:message><wsdl:message name="IService1_generarFactura_InputMessage"><wsdl:part name="parameters" element="tns:generarFactura"/></wsdl:message><wsdl:message name="IService1_generarFactura_OutputMessage"><wsdl:part name="parameters" element="tns:generarFacturaResponse"/></wsdl:message><wsdl:message name="IService1_darDeBaja_InputMessage"><wsdl:part name="parameters" element="tns:darDeBaja"/></wsdl:message><wsdl:message name="IService1_darDeBaja_OutputMessage"><wsdl:part name="parameters" element="tns:darDeBajaResponse"/></wsdl:message><wsdl:message name="IService1_darDeBajaNotaCredito_InputMessage"><wsdl:part name="parameters" element="tns:darDeBajaNotaCredito"/></wsdl:message><wsdl:message name="IService1_darDeBajaNotaCredito_OutputMessage"><wsdl:part name="parameters" element="tns:darDeBajaNotaCreditoResponse"/></wsdl:message><wsdl:message name="IService1_darDeBajaNotaDebito_InputMessage"><wsdl:part name="parameters" element="tns:darDeBajaNotaDebito"/></wsdl:message><wsdl:message name="IService1_darDeBajaNotaDebito_OutputMessage"><wsdl:part name="parameters" element="tns:darDeBajaNotaDebitoResponse"/></wsdl:message><wsdl:message name="IService1_convertiToLetter_InputMessage"><wsdl:part name="parameters" element="tns:convertiToLetter"/></wsdl:message><wsdl:message name="IService1_convertiToLetter_OutputMessage"><wsdl:part name="parameters" element="tns:convertiToLetterResponse"/></wsdl:message><wsdl:message name="IService1_generarNotaCredito_InputMessage"><wsdl:part name="parameters" element="tns:generarNotaCredito"/></wsdl:message><wsdl:message name="IService1_generarNotaCredito_OutputMessage"><wsdl:part name="parameters" element="tns:generarNotaCreditoResponse"/></wsdl:message><wsdl:message name="IService1_generarNotaDebito_InputMessage"><wsdl:part name="parameters" element="tns:generarNotaDebito"/></wsdl:message><wsdl:message name="IService1_generarNotaDebito_OutputMessage"><wsdl:part name="parameters" element="tns:generarNotaDebitoResponse"/></wsdl:message><wsdl:portType name="IService1"><wsdl:operation name="GetData"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetData" message="tns:IService1_GetData_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataResponse" message="tns:IService1_GetData_OutputMessage"/></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContract" message="tns:IService1_GetDataUsingDataContract_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContractResponse" message="tns:IService1_GetDataUsingDataContract_OutputMessage"/></wsdl:operation><wsdl:operation name="generarFactura"><wsdl:input wsaw:Action="http://tempuri.org/IService1/generarFactura" message="tns:IService1_generarFactura_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/generarFacturaResponse" message="tns:IService1_generarFactura_OutputMessage"/></wsdl:operation><wsdl:operation name="darDeBaja"><wsdl:input wsaw:Action="http://tempuri.org/IService1/darDeBaja" message="tns:IService1_darDeBaja_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/darDeBajaResponse" message="tns:IService1_darDeBaja_OutputMessage"/></wsdl:operation><wsdl:operation name="darDeBajaNotaCredito"><wsdl:input wsaw:Action="http://tempuri.org/IService1/darDeBajaNotaCredito" message="tns:IService1_darDeBajaNotaCredito_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/darDeBajaNotaCreditoResponse" message="tns:IService1_darDeBajaNotaCredito_OutputMessage"/></wsdl:operation><wsdl:operation name="darDeBajaNotaDebito"><wsdl:input wsaw:Action="http://tempuri.org/IService1/darDeBajaNotaDebito" message="tns:IService1_darDeBajaNotaDebito_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/darDeBajaNotaDebitoResponse" message="tns:IService1_darDeBajaNotaDebito_OutputMessage"/></wsdl:operation><wsdl:operation name="convertiToLetter"><wsdl:input wsaw:Action="http://tempuri.org/IService1/convertiToLetter" message="tns:IService1_convertiToLetter_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/convertiToLetterResponse" message="tns:IService1_convertiToLetter_OutputMessage"/></wsdl:operation><wsdl:operation name="generarNotaCredito"><wsdl:input wsaw:Action="http://tempuri.org/IService1/generarNotaCredito" message="tns:IService1_generarNotaCredito_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/generarNotaCreditoResponse" message="tns:IService1_generarNotaCredito_OutputMessage"/></wsdl:operation><wsdl:operation name="generarNotaDebito"><wsdl:input wsaw:Action="http://tempuri.org/IService1/generarNotaDebito" message="tns:IService1_generarNotaDebito_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/generarNotaDebitoResponse" message="tns:IService1_generarNotaDebito_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IService1" type="tns:IService1"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetData"><soap:operation soapAction="http://tempuri.org/IService1/GetData" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><soap:operation soapAction="http://tempuri.org/IService1/GetDataUsingDataContract" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="generarFactura"><soap:operation soapAction="http://tempuri.org/IService1/generarFactura" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="darDeBaja"><soap:operation soapAction="http://tempuri.org/IService1/darDeBaja" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="darDeBajaNotaCredito"><soap:operation soapAction="http://tempuri.org/IService1/darDeBajaNotaCredito" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="darDeBajaNotaDebito"><soap:operation soapAction="http://tempuri.org/IService1/darDeBajaNotaDebito" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="convertiToLetter"><soap:operation soapAction="http://tempuri.org/IService1/convertiToLetter" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="generarNotaCredito"><soap:operation soapAction="http://tempuri.org/IService1/generarNotaCredito" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="generarNotaDebito"><soap:operation soapAction="http://tempuri.org/IService1/generarNotaDebito" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Service1"><wsdl:port name="BasicHttpBinding_IService1" binding="tns:BasicHttpBinding_IService1"><soap:address location="http://192.168.1.13:2/Service1.svc"/></wsdl:port></wsdl:service></wsdl:definitions>