Code/FowardOriginalCaller/ForwardOriginalCallerComponent/sample.xml

<?xml version="1.0" encoding="utf-8"?>
<!-- Created with Liquid XML Studio 6.1.15.0 - FREE Community Edition (http://www.liquid-technologies.com) -->
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<a:Action s:mustUnderstand="1" u:Id="_2" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:a="http://www.w3.org/2005/08/addressing">http://tempuri.org/IService1/GetData</a:Action>
		<OriginalCaller xmlns="http://www.riziv-inami.fgov.be/BizTalk/common">RIZIV\PB9082</OriginalCaller>
		<a:MessageID u:Id="_3" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:a="http://www.w3.org/2005/08/addressing">urn:uuid:f1e3bd9f-bd4c-4ee4-86bc-852e665c6527</a:MessageID>
		<a:ReplyTo u:Id="_4" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:a="http://www.w3.org/2005/08/addressing">
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1" u:Id="_5" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:a="http://www.w3.org/2005/08/addressing">http://localhost/TestAuthzBehavior/Service.svc</a:To>
		<o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="uuid-04e9685b-ce57-4d91-aba5-af683a7ea794-24" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<u:Created>2010-04-28T06:51:05.442Z</u:Created>
				<u:Expires>2010-04-28T06:56:05.442Z</u:Expires>
			</u:Timestamp>
			<c:SecurityContextToken u:Id="uuid-2abbeb76-13fa-4bcc-a52a-fc4d2d744a81-10" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<c:Identifier>urn:uuid:bbd3d720-5569-4528-b6eb-22dd70ca1d15</c:Identifier>
			</c:SecurityContextToken>
			<c:DerivedKeyToken u:Id="uuid-04e9685b-ce57-4d91-aba5-af683a7ea794-22" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<o:SecurityTokenReference>
					<o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" URI="#uuid-2abbeb76-13fa-4bcc-a52a-fc4d2d744a81-10">
					</o:Reference>
				</o:SecurityTokenReference>
				<c:Offset>0</c:Offset>
				<c:Length>24</c:Length>
				<c:Nonce>
					<!-- Removed-->
				</c:Nonce>
			</c:DerivedKeyToken>
			<c:DerivedKeyToken u:Id="uuid-04e9685b-ce57-4d91-aba5-af683a7ea794-23" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<o:SecurityTokenReference>
					<o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" URI="#uuid-2abbeb76-13fa-4bcc-a52a-fc4d2d744a81-10">
					</o:Reference>
				</o:SecurityTokenReference>
				<c:Nonce>
					<!-- Removed-->
				</c:Nonce>
			</c:DerivedKeyToken>
			<e:ReferenceList xmlns:e="http://www.w3.org/2001/04/xmlenc#">
				<e:DataReference URI="#_1">
				</e:DataReference>
				<e:DataReference URI="#_6">
				</e:DataReference>
			</e:ReferenceList>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
					</CanonicalizationMethod>
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1">
					</SignatureMethod>
					<Reference URI="#_0">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>yoVJx7HW8pJjdJvxWJBZVzexuKg=</DigestValue>
					</Reference>
					<Reference URI="#_2">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>Nd3zh9KcVZgrxzfQK1EhzjrBrmI=</DigestValue>
					</Reference>
					<Reference URI="#_3">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>BTSGeluq3jFe4JU9dMmR1MQkHAc=</DigestValue>
					</Reference>
					<Reference URI="#_4">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>l6mMmQ2LE9VFtjaA6Qc4GKBXURw=</DigestValue>
					</Reference>
					<Reference URI="#_5">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>CQJYnYLQhgLpWBtJGaZWRVwbT5s=</DigestValue>
					</Reference>
					<Reference URI="#uuid-04e9685b-ce57-4d91-aba5-af683a7ea794-24">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
							</Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1">
						</DigestMethod>
						<DigestValue>s5JT2TiZuCV2Zdn8mJy/rWc2PW0=</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>fV9qxSt1FOGRdaPsN/cCvL5UpAk=</SignatureValue>
				<KeyInfo>
					<o:SecurityTokenReference xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/dk" URI="#uuid-04e9685b-ce57-4d91-aba5-af683a7ea794-22">
						</o:Reference>
					</o:SecurityTokenReference>
				</KeyInfo>
			</Signature>
		</o:Security>
	</s:Header>
	<s:Body u:Id="_0" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
		<GetData xmlns="http://tempuri.org/">
			<value>5</value>
		</GetData>
	</s:Body>
</s:Envelope>