SoapClient/ClientApp/GetDataUsingDataContractRequest.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<GetDataUsingDataContract xmlns="http://tempuri.org/">
			<composite xmlns:a="http://schemas.datacontract.org/2004/07/WcfService1" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
				<a:BoolValue>true</a:BoolValue>
				<a:StringValue>test str</a:StringValue>
			</composite>
		</GetDataUsingDataContract>
	</s:Body>
</s:Envelope>