samples/get-contract-req-with-headers.txt

POST http://localhost:53016/Service1.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
VsDebuggerCausalityData: uIDPoy+B3DCzWO5Dj/n78OwtfmcAAAAA5msNxjeXbUifbsUhPmy3wjDMIwR0yAVJvzxiBSl7EFcACQAA
SOAPAction: "http://tempuri.org/IService1/GetDataUsingDataContract"
Host: localhost:53016
Content-Length: 388
Expect: 100-continue
Accept-Encoding: gzip, deflate

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetDataUsingDataContract xmlns="http://tempuri.org/"><composite xmlns:a="http://schemas.datacontract.org/2004/07/WcfService1" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:BoolValue>true</a:BoolValue><a:StringValue>This is a test</a:StringValue></composite></GetDataUsingDataContract></s:Body></s:Envelope>
